CFDEM/CFDEMcoupling/tutorials/cfdemSolverRhoPimple/ErgunTestMPI/CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    wall
    {
        type            slip;
    }

    inlet
    {
        type            interstitialUniformInletVelocity;
        inletVelocity   table
        (
            (0.0 (0 0 0.01))
            (0.5 (0 0 1.00))
        );
        alpha           voidfraction;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
